In [21]:
import sqlite3
import pandas as pd
import tabulate

In [22]:
# Import stocks data
spy_data = pd.read_csv("SPY.csv")

# Both data have the same column names, I'm going to rename the adjClose columns
spy_rename = spy_data.rename(columns={'adjClose': 'spy_adjClose'})

spy_rename.head(5)

,date,close,high,low,open,volume,spy_adjClose,adjHigh,adjLow,adjOpen,adjVolume,divCash,splitFactor
0,1993-01-29,43.9375,43.9687,43.7500,43.9687,1003200,24.367308,24.384612,24.263323,24.384612,1003200,0.0,1.0
1,1993-02-01,44.2500,44.2500,43.9687,43.9687,480500,24.540618,24.540618,24.384612,24.384612,480500,0.0,1.0
2,1993-02-02,44.3437,44.3750,44.1250,44.2187,201300,24.592583,24.609942,24.471294,24.523259,201300,0.0,1.0
3,1993-02-03,44.8125,44.8437,44.3750,44.4062,529400,24.852575,24.869878,24.609942,24.627245,529400,0.0,1.0
4,1993-02-04,45.0000,45.0937,44.4687,44.9687,531500,24.956560,25.008526,24.661907,24.939202,531500,0.0,1.0

In [23]:
print(spy_rename.columns)
print(spy_rename.shape)
print(spy_rename.dtypes)

Index(['date', 'close', 'high', 'low', 'open', 'volume', 'spy_adjClose',
       'adjHigh', 'adjLow', 'adjOpen', 'adjVolume', 'divCash', 'splitFactor'],
      dtype='object')
(8169, 13)
date             object
close           float64
high            float64
low             float64
open            float64
volume            int64
spy_adjClose    float64
adjHigh         float64
adjLow          float64
adjOpen         float64
adjVolume         int64
divCash         float64
splitFactor     float64
dtype: object

In [24]:
# Checking missing values
spy_rename.isnull().values.any()

np.False_

Great! We don't have any missing value in our spy_raname dataset.

In [25]:
# Import bond data
tlt_data = pd.read_csv("tlt.csv")

# Both data have the same column names, I'm going to rename the adjClose columns
tlt_rename = tlt_data.rename(columns={'adjClose': 'tlt_adjClose'})

tlt_rename.head(5)

,date,close,high,low,open,volume,tlt_adjClose,adjHigh,adjLow,adjOpen,adjVolume,divCash,splitFactor
0,2002-07-26,82.51,82.80,82.42,82.67,316300,37.841243,37.974245,37.799967,37.914623,316300,0.0,1.0
1,2002-07-29,81.42,82.16,81.32,82.06,8400,37.341341,37.680724,37.295478,37.634861,8400,0.0,1.0
2,2002-07-30,81.52,81.90,81.52,81.75,6100,37.387203,37.561481,37.387203,37.492687,6100,0.0,1.0
3,2002-07-31,82.53,82.80,81.90,81.95,29400,37.850416,37.974245,37.561481,37.584413,29400,0.0,1.0
4,2002-08-01,83.00,83.02,82.54,82.54,25000,38.065970,38.075143,37.855002,37.855002,25000,0.0,1.0

In [26]:
print(tlt_rename.columns)
print(tlt_rename.shape)
print(tlt_rename.dtypes)

Index(['date', 'close', 'high', 'low', 'open', 'volume', 'tlt_adjClose',
       'adjHigh', 'adjLow', 'adjOpen', 'adjVolume', 'divCash', 'splitFactor'],
      dtype='object')
(5778, 13)
date             object
close           float64
high            float64
low             float64
open            float64
volume            int64
tlt_adjClose    float64
adjHigh         float64
adjLow          float64
adjOpen         float64
adjVolume         int64
divCash         float64
splitFactor     float64
dtype: object

In [27]:
# Checking missing values for tlt dataset
tlt_rename.isnull().values.any()

np.False_

Great! We don't have any missing value in our tlt_raname dataset.

In [28]:
# Both data have the same column names, I'm going to rename the adjClose columns
# spy_df = pd.DataFrame(spy_data)
# tlt_df = pd.DataFrame(tlt_data)

# spy_df_renamed = spy_df.rename(columns={'adjClose': 'spy_adjClose'})
# tlt_df_renamed = tlt_df.rename(columns={'adjClose': 'tlt_adjClose'})

# print(spy_df_renamed)
# print(tlt_df_renamed)

In [29]:
# Create SQLite database and tables
conn = sqlite3.connect("example.db")
cursor = conn.cursor()

# Create tables spy_data
cursor.execute("""
CREATE TABLE IF NOT EXISTS spy (
   date TEXT NOT NULL PRIMARY KEY,
   spy_adjClose FLOAT NOT NULL             
);
""")

# Create tables tlt_data
cursor.execute("""
CREATE TABLE IF NOT EXISTS tlt (
   date TEXT NOT NULL PRIMARY KEY,
   tlt_adjClose FLOAT NOT NULL             
);
""")

# Insert data into tables
spy_rename.to_sql("spy", conn, if_exists="replace", index=False)
tlt_rename.to_sql("tlt", conn, if_exists="replace", index=False)

# Verify data was inserted
print("SPY Table:\n")
print(pd.read_sql_query("SELECT * FROM spy", conn).head(5))

print("\nTLT Table:\n")
print(pd.read_sql_query("SELECT * FROM tlt", conn).head(5))

SPY Table:

         date    close     high      low     open   volume  spy_adjClose  \
0  1993-01-29  43.9375  43.9687  43.7500  43.9687  1003200     24.367308
1  1993-02-01  44.2500  44.2500  43.9687  43.9687   480500     24.540618
2  1993-02-02  44.3437  44.3750  44.1250  44.2187   201300     24.592583
3  1993-02-03  44.8125  44.8437  44.3750  44.4062   529400     24.852575
4  1993-02-04  45.0000  45.0937  44.4687  44.9687   531500     24.956560

     adjHigh     adjLow    adjOpen  adjVolume  divCash  splitFactor
0  24.384612  24.263323  24.384612    1003200      0.0          1.0
1  24.540618  24.384612  24.384612     480500      0.0          1.0
2  24.609942  24.471294  24.523259     201300      0.0          1.0
3  24.869878  24.609942  24.627245     529400      0.0          1.0
4  25.008526  24.661907  24.939202     531500      0.0          1.0

TLT Table:

         date  close   high    low   open  volume  tlt_adjClose    adjHigh  \
0  2002-07-26  82.51  82.80  82.42  82.67  316300     37.841243  37.974245
1  2002-07-29  81.42  82.16  81.32  82.06    8400     37.341341  37.680724
2  2002-07-30  81.52  81.90  81.52  81.75    6100     37.387203  37.561481
3  2002-07-31  82.53  82.80  81.90  81.95   29400     37.850416  37.974245
4  2002-08-01  83.00  83.02  82.54  82.54   25000     38.065970  38.075143

      adjLow    adjOpen  adjVolume  divCash  splitFactor
0  37.799967  37.914623     316300      0.0          1.0
1  37.295478  37.634861       8400      0.0          1.0
2  37.387203  37.492687       6100      0.0          1.0
3  37.561481  37.584413      29400      0.0          1.0
4  37.855002  37.855002      25000      0.0          1.0

In [30]:
# Setting up query function
def query(query:str):
    return pd.read_sql(query, conn)

In [31]:
# Join two datasets. 
final_query = """
SELECT spy.date, spy.spy_adjClose, tlt.tlt_adjClose
FROM spy
INNER JOIN tlt
    ON spy.date = tlt.date;
"""
final_data = query(final_query)

print(final_data)

            date  spy_adjClose  tlt_adjClose
0     2002-07-26     55.824445     37.841243
1     2002-07-29     58.543930     37.341341
2     2002-07-30     59.306954     37.387203
3     2002-07-31     59.450430     37.850416
4     2002-08-01     57.898298     38.065970
...          ...           ...           ...
5773  2025-07-08    620.340000     86.030000
5774  2025-07-09    624.060000     86.930000
5775  2025-07-10    625.820000     86.990000
5776  2025-07-11    623.620000     85.790000
5777  2025-07-14    624.810000     85.610000

[5778 rows x 3 columns]

In [32]:
final_data.to_csv('clean_data.csv', index=False)